Repository: KDE/knetwalk
Catalog: po/*/knetwalk.po
Languages: eo

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net

source: Width of the grid
eo: Larĝeco de la krado

source: Width:
eo: Larĝeco:

source: Wrap from left to right and from top to bottom
eo: Volvi de maldekstre dekstren kaj de supre malsupren

source: Wrapping
eo: Volvado

source: Height of the grid
eo: Alteco de la krado

source: Height:
eo: Alteco:

source: Note: to win the game all terminals <strong>and all <em>cables</em></strong> need to be connected to the server!
eo: Noto: por gajni la ludon ĉiuj terminaloj <strong>kaj ĉiuj <em>kabloj</em></strong> devas esti konektitaj al la servilo!

source: The game is not won yet!
eo: La ludo ankoraŭ ne estas venkita!

source: Duration for cell to complete one rotation in milliseconds
eo: Daŭro por ĉelo kompletigi unu rotacion en milisekundoj

source: Rotate duration:
eo: Daŭro de rotacio:

source: Play sounds on actions
eo: Ludo sonorojn je agoj

source: Play sounds
eo: Ludi sonorojn

source: Automatically lock cell after rotation
eo: Aŭtomate ŝlosi ĉelon post rotacio

source: Auto lock
eo: Aŭtomate ŝlosi

source: Reverse mouse buttons
eo: Inversigi musbutonojn

source: Default user name
eo: Defaŭlta uzantnomo

source: Whether game sounds are played.
eo: Ĉu ludsonoj estas luditaj.

source: Whether lock cell after rotation.
eo: Ĉu ŝlosi ĉelon post rotacio.

source: Use left click for clockwise and right click for counter-clockwise.
eo: Uzu maldekstran klakon por dekstrume kaj dekstren por maldekstrume.

source: Duration for cell to complete one rotation.
eo: Daŭro por ĉelo kompletigi unu rotacion.

source: The width of the board.
eo: La larĝo de la tabulo.

source: The height of the board.
eo: La alteco de la tabulo.

source: Whether wrap from left to right and from top to bottom is enabled.
eo: Ĉu volvado de maldekstre dekstren kaj de supre malsupren estas ebligita.

source: Main Toolbar
eo: Ĉefa ilobreto

source: KNetWalk, a game for system administrators.
eo: KNetWalk, ludo por sistemestroj.

source: (C) 2004-2005 Andi Peredri, ported to KDE by Thomas Nagy (C) 2007-2008 Fela Winkelmolen (C) 2013 Ashwin Rajeev
eo: (C) 2004-2005 Andi Peredri, portado al KDE de Thomas Nagy (C) 2007-2008 Fela Winkelmolen (C) 2013 Ashwin Rajeev

source: original author
eo: origina aŭtoro

source: KDE port
eo: KDE-portado

source: Port to QtQuick
eo: Portado al QtQuick

source: icon design
eo: piktogramdezajno

source: Port to use the QGraphicsView framework
eo: Portado al uzo de la QGraphicsView-framo

# @item difficulty
source: Custom
eo: Propra

# @action
source: &Unlock All
eo: Malŝlosi Ĉi&ujn

# @action
source: Move Right
eo: Movi Dekstren

# @action
source: Move Left
eo: Move Maldekstren

# @action
source: Move Up
eo: Movi Supren

# @action
source: Move Down
eo: Move Malsupren

# @action
source: Turn Clockwise
eo: Rotacii Dekstrume

# @action
source: Turn Counterclockwise
eo: Rotacii Maldekstrume

# @action
source: Toggle Lock
eo: Baskuligi Ŝloson

# @title:tab
source: General
eo: Ĝenerala

# @title:tab
source: Theme
eo: Etoso

# @title:tab
source: Custom Game
eo: Propra Ludo

source: Moves Penalty
eo: Puno pri Movoj

source: Your score was %1, you did not make it to the high score list.
eo: Via poentaro estis %1, vi ne atingis la altpoentaran liston.

# Number of mouse clicks
source: Moves: %1
eo: Movoj: %1

# Time elapsed
source: Time: %1
eo: Tempdaŭro: %1

source: Paused
eo: Paŭzita
